#define LED_SERIAL 		1
#define LED_USB 		2
#define LED_4G_WIFI 	3
#define LED_RUNING 		4
#define LED_ALERT 		5



/**************************************************************************************
** 函数名称:		ledLongOpen
** 功能描述:		点亮指定led
** 输　入  : 		index		指定要操作的led编号,led编号对应关系见上面的宏定义                      
** 输　出  : 		0, 错误返回 -1
**************************************************************************************/
int ledLongOpen(int index);

/**************************************************************************************
** 函数名称:		ledLongClose
** 功能描述:		熄灭led
** 输　入  : 		index		指定要操作的led编号,led编号对应关系见上面的宏定义                      
** 输　出  : 		0, 错误返回 -1
**************************************************************************************/
int ledLongClose(int index);

/**************************************************************************************
** 函数名称:		ledFlickerOpen
** 功能描述:		开启led闪烁功能
** 输　入  : 		index		指定要操作的led编号,led编号对应关系见上面的宏定义 
**				time_number	给定闪烁的时间,单位ms
** 输　出  : 		0, 错误返回 -1
**************************************************************************************/
int ledFlickerOpen(int index,char * time_number );

/**************************************************************************************
** 函数名称:		ledFlickerClose
** 功能描述:		关闭led闪烁功能
** 输　入  : 		index		指定要操作的led编号,led编号对应关系见上面的宏定义 
** 输　出  : 		0, 错误返回 -1
**************************************************************************************/
int ledFlickerClose(int index);

